In [5]:
import pandas as pd
import numpy as np
from pandas import *

In [3]:
# series -> 由 數組 和 index組成
obj =  Series([11,22,55,88,99])
print obj ,'\n';
print obj.index ,'\n';
print obj.values;

0    11
1    22
2    55
3    88
4    99
dtype: int64

Int64Index([0, 1, 2, 3, 4], dtype='int64')

[11 22 55 88 99]

In [4]:
obj2 = Series( [4, 7, -5, 3], index=['a' , 'b' ,'c','d'])
print obj2
print '\n',obj2['c']
print '\n', obj2[[ 'c' , 'a', 'd']]

a    4
b    7
c   -5
d    3
dtype: int64

-5

c   -5
a    4
d    3
dtype: int64

In [5]:
print obj2[obj2 > 0] #布林數組
print 
print 'b' in obj2
print 4 in obj2

a    4
b    7
d    3
dtype: int64

True
False

In [6]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah' : 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [7]:
states = ['California' , 'Ohio' , 'Oregon' , 'Texas']
obj4 = Series(sdata, index=states)
obj4 # NaN = missing value

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [8]:
pd.isnull(obj4) #檢測 missing value

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [10]:
obj4.isnull()#檢測 missing value

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [11]:
# index 自動對齊
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [12]:
obj4.name = 'population'

In [14]:
obj4.index.name = 'state'

In [15]:
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [20]:
obj.index = ['Bob','Steve','Jeff', 'Ryan','Roxas']
obj

Bob      11
Steve    22
Jeff     55
Ryan     88
Roxas    99
dtype: int64

In [24]:
#建構 DataFrame
data = {
    'state':['Bob','Steve','Jeff', 'Ryan','Roxas'],
    'year':[2000,2001,2000,2001,2002],
    'pop':[1.5,3.7,2.9,1.6,4.7]
}

frame = DataFrame(data)

frame

   pop  state  year
0  1.5    Bob  2000
1  3.7  Steve  2001
2  2.9   Jeff  2000
3  1.6   Ryan  2001
4  4.7  Roxas  2002

In [23]:
DataFrame(data , columns=['year','state','pop'])

   year  state  pop
0  2000    Bob  1.5
1  2001  Steve  3.7
2  2000   Jeff  2.9
3  2001   Ryan  1.6
4  2002  Roxas  4.7

In [32]:
frame2 = DataFrame(data, columns=['year' , 'state' , 'pop' , 'debt'] , index=['one','two','three','four','five'] )
frame2

       year  state  pop debt
one    2000    Bob  1.5  NaN
two    2001  Steve  3.7  NaN
three  2000   Jeff  2.9  NaN
four   2001   Ryan  1.6  NaN
five   2002  Roxas  4.7  NaN

In [29]:
print '行輸出'
print frame2['state'],'\n\n'
print '列輸出'
print frame2.ix['three']

行輸出
one        Bob
two      Steve
three     Jeff
four      Ryan
five     Roxas
Name: state, dtype: object


列輸出
year     2000
state    Jeff
pop       2.9
debt      NaN
Name: three, dtype: object

In [31]:
frame2 ['debt'] = np.arange(5.) #行賦值
frame2

       year  state  pop  debt
one    2000    Bob  1.5     0
two    2001  Steve  3.7     1
three  2000   Jeff  2.9     2
four   2001   Ryan  1.6     3
five   2002  Roxas  4.7     4

In [34]:
val = Series([ -1.2, -1.5, -1.7] , index=[ 'two' , 'four' , 'five'])
frame2['debt'] = val
frame2

       year  state  pop  debt
one    2000    Bob  1.5   NaN
two    2001  Steve  3.7  -1.2
three  2000   Jeff  2.9   NaN
four   2001   Ryan  1.6  -1.5
five   2002  Roxas  4.7  -1.7

In [39]:
frame2['eastern'] = frame2.state == 'Roxas' #新增列 與 呼叫 column的方式
frame2

       year  state  pop  debt eastern
one    2000    Bob  1.5   NaN   False
two    2001  Steve  3.7  -1.2   False
three  2000   Jeff  2.9   NaN   False
four   2001   Ryan  1.6  -1.5   False
five   2002  Roxas  4.7  -1.7    True

In [40]:
del frame2['eastern'] #刪除列
frame2

       year  state  pop  debt
one    2000    Bob  1.5   NaN
two    2001  Steve  3.7  -1.2
three  2000   Jeff  2.9   NaN
four   2001   Ryan  1.6  -1.5
five   2002  Roxas  4.7  -1.7

In [42]:
#建構 DataFrame(2)
pop = {'Nevada': {2001 : 2.4, 2002 : 2.9},
'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6}}

frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [43]:
# DataFrame 轉置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [45]:
#建構 DataFrame(3)
pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [50]:
# index object -> 不可修改
obj = Series(range(3), index = ['a','b','c'])
index = obj.index
index[1] = 'd'

TypeError: Index does not support mutable operations

In [55]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0] , index=index)
obj2.index is index

True

In [160]:
# index 相當於 一個 固定大小的集合 
frame3
print 'Nevada' in frame3.columns
print 2001 in frame3.index

#呼叫 index
print '\n\n'
print frame3.loc[2000]
print '\n\n'
print frame3.iloc[1]
print '\n\n'
print frame3.ix[2000]
print '\n'
print frame3.ix[[2000,2001],['Ohio','Nevada']]

True
True



Nevada    NaN
Ohio      1.5
Name: 2000, dtype: float64



Nevada    2.4
Ohio      1.7
Name: 2001, dtype: float64



Nevada    NaN
Ohio      1.5
Name: 2000, dtype: float64


      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [126]:
obj = Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'] )
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [128]:
#重新索引
obj2 = obj.reindex(['a' , 'b' , 'c', 'd' , 'e' ])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [133]:
frame.reindex([0,1,2,3,4,5])

   pop  state  year
0  1.5    Bob  2000
1  3.7  Steve  2001
2  2.9   Jeff  2000
3  1.6   Ryan  2001
4  4.7  Roxas  2002
5  NaN    NaN   NaN

In [137]:
# ffill 可實現 向前填充值
obj3 = Series(['blue' , 'purple' , 'yellow'], index= [0, 2, 4])
print obj3
print '\n'
print obj3.reindex(range(6), method = 'ffill')

0      blue
2    purple
4    yellow
dtype: object


0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [204]:
# DataFrame 的 reindex
frame = DataFrame(np.arange(9).reshape((3,3)) , 
                  index=['a','c','d'],
                  columns=['Roxas','Texas','Zoxas'])
frame
frame2 = frame.reindex([ 'a' , 'b' ,'c', 'd' ])
frame2

   Roxas  Texas  Zoxas
a      0      1      2
b    NaN    NaN    NaN
c      3      4      5
d      6      7      8

In [154]:
states = ['Texas' , 'Utah' , 'Roxas']
print frame.reindex(columns=states)
print '===========  reindex 會是新的一份  =================='
print frame

   Texas  Utah  Roxas
a      1   NaN      0
c      4   NaN      3
d      7   NaN      6
===========  reindex 會是新的一份  ==================
   Roxas  Texas  Zoxas
a      0      1      2
c      3      4      5
d      6      7      8

In [157]:
frame.reindex(index=['a','b','c','d'], method ='ffill',columns=states)

   Texas  Utah  Roxas
a      1   NaN      0
b      1   NaN      0
c      4   NaN      3
d      7   NaN      6

In [162]:
#丟棄指定軸上的項
obj = Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj = obj.drop(['c','d'])
new_obj

a    0
b    1
e    4
dtype: float64

In [165]:
frame2.drop('b')

   Roxas  Texas  Zoxas
a      0      1      2
c      3      4      5
d      6      7      8

In [166]:
frame2.drop('Texas',axis = 1)

   Roxas  Zoxas
a      0      2
b    NaN    NaN
c      3      5
d      6      8

In [175]:
# index 選取 和 過濾
print obj['a'] ,obj[0],'\n'
print obj[['b','a','d']] # 利用標籤的切片包含末端 , 可以對其賦值

0.0 0.0

b    1
a    0
d    3
dtype: float64

In [192]:
frame2[0:1] # 只能用切片 列的單索引會出錯

   Roxas  Texas  Zoxas
a      0      1      2

In [205]:
frame2 = frame2.drop('b')
frame2

   Roxas  Texas  Zoxas
a      0      1      2
c      3      4      5
d      6      7      8

In [208]:
frame2[frame2['Texas'] > 3]

   Roxas  Texas  Zoxas
c      3      4      5
d      6      7      8

In [209]:
frame2 > 5

   Roxas  Texas  Zoxas
a  False  False  False
c  False  False  False
d   True   True   True

In [213]:
frame2['Roxas']

a    0
c    3
d    6
Name: Roxas, dtype: float64

In [216]:
#算術運算 和 數據對齊
s1 = Series([7.3, -2.5 ,3.4,1.5], index=[ 'a' , 'c' , 'd' , 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1] , index=['a','c','e','f','g'])

s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [219]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)) , columns=list('bcd'),
index=[ 'Ohio' , 'Texas' , 'Colorado'])

df2 = DataFrame(np.arange(12.).reshape((4, 3)),columns=list('bde'),
index=['Utah' , 'Ohio' , 'Texas' , 'Oregon'])

df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [224]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [225]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [226]:
# DataFrame missing value 填值後 相加  其他算術方法還有 sub , div , mul
df1.add(df2,fill_value=0)

          b   c   d   e
Colorado  6   7   8 NaN
Ohio      3   1   6   5
Oregon    9 NaN  10  11
Texas     9   4  12   8
Utah      0 NaN   1   2

In [228]:
# DataFrame 和  Series 之間的運算
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [230]:
# broadcasting 
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [232]:
series = df1.ix[0]
series

b    0
c    1
d    2
Name: Ohio, dtype: float64

In [234]:
# 匹配索引後 會一直向下廣播
df1 - series

          b  c  d
Ohio      0  0  0
Texas     3  3  3
Colorado  6  6  6

In [235]:
series2 = Series(range(3) , index=[ 'b' , 'e' , 'f' ])

df1 + series2

          b   c   d   e   f
Ohio      0 NaN NaN NaN NaN
Texas     3 NaN NaN NaN NaN
Colorado  6 NaN NaN NaN NaN

In [236]:
# 希望在列上廣播 需要用到算術方法
series3 = df1['d']

df1.sub(series3 , axis = 0)

          b  c  d
Ohio     -2 -1  0
Texas    -2 -1  0
Colorado -2 -1  0

In [240]:
frame.ix[0] = [-1,-2,-3]
frame

   Roxas  Texas  Zoxas
a     -1     -2     -3
c      3      4      5
d      6      7      8

In [241]:
# numpy 對 DataFrame 的應用
np.abs(frame)

   Roxas  Texas  Zoxas
a      1      2      3
c      3      4      5
d      6      7      8

In [242]:
# 將函數應用到 數組上面
f = lambda x: x.max() - x.min()

frame.apply(f)

Roxas     7
Texas     9
Zoxas    11
dtype: int64

In [243]:
frame.apply(f,axis=1)

a    2
c    2
d    2
dtype: int64

In [244]:
def f(x) :
    return Series([x.min() , x.max()] , index= [ 'min' , 'max'])

In [245]:
frame.apply(f)

     Roxas  Texas  Zoxas
min     -1     -2     -3
max      6      7      8

In [247]:
format = lambda x: '%.2f'% x
frame.ix[1] = [1.2,1.3,0.5]

In [250]:
#假如你想得到 Dataframe中各個浮點值格式化字符串
frame.applymap(format)

   Roxas  Texas  Zoxas
a  -1.00  -2.00  -3.00
c   1.20   1.30   0.50
d   6.00   7.00   8.00

In [254]:
frame['Zoxas'].map(format)

a    -3.00
c     0.50
d     8.00
Name: Zoxas, dtype: object

In [258]:
# DataFrame Series 排序
obj = Series(range(4) , index=['d' , 'a' , 'b' , 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [260]:
frame = DataFrame(np.arange(8).reshape((2, 4)) , index=['three' ,'one'],
columns=[ 'd' , 'a' , 'b' , 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [261]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [263]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [264]:
frame.sort_index(axis=1 , ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [267]:
#任何缺失值默認都會被放到Series的末尾:
obj = Series([4,np.nan , 7, np.nan, -3, 2])
obj.sort_values()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [269]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [270]:
frame.sort_index(by='b')

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [272]:
frame.sort_index(by= [ 'a' , 'b' ]) # 根據多值排序

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [273]:
# DataFrame Series 排名 (默認 為各組分配一個平均排名 破壞平級關係)
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj .rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [274]:
obj.rank(method='first') #按照原順序給出排名

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [275]:
obj.rank(ascending=False, method= 'max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [276]:
frame = DataFrame({'b': [4.3,7,-3, 2], 'a': [0, 1, 0, 1],
'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [278]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [285]:
#Series 和 DataFrame 可以帶有重複的 index
obj = Series(range(5) , index=[ 'a' , 'a' , 'b' , 'b' , 'C'])
print obj
print '\n',obj.index.is_unique

a    0
a    1
b    2
b    3
C    4
dtype: int64

False

In [286]:
obj['a']

a    0
a    1
dtype: int64

In [289]:
# 匯總和計算描述統計

df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],
              index=['a','b','c','d'],
              columns=['one','two'] )

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [290]:
df.sum() #NaN會自動被排除

one    9.25
two   -5.80
dtype: float64

In [291]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [292]:
df.mean(axis=1, skipna=False) #不要讓NA被排除

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [293]:
df.idxmax()

one    b
two    d
dtype: object

In [294]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [296]:
df.describe() # 一次產生多個匯總統計

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [297]:
# 召喚 網路數據
import pandas.io.data as web

C:\Anaconda2\lib\site-packages\pandas\io\data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [300]:
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker,'1/1/2000','1/1/2010')

price = DataFrame({tic : data['Adj Close']
                          for tic , data in all_data.iteritems() })

volume = DataFrame({tic : data['Volume']
                          for tic , data in all_data.iteritems() })

In [315]:
#價格的百分數變化:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [317]:
#Series的 corr方法用於計算兩個 Series中重疊的、非 NA的、按索引對齊的值的相關系數
returns.MSFT.corr(returns.IBM)

0.49597968454928909

In [320]:
#與此類似， cov用于計算協方差
returns.MSFT.cov(returns.IBM)

0.00021595764843398285

In [321]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [322]:
returns.cov( )

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [323]:
# DataFrame v.s Series 的 cor
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [325]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [327]:
# 唯一值
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [328]:
#出現次數
obj.value_counts() #也可以這樣用  pd.value_counts(obj.values,sort=False)

c    3
a    3
b    2
d    1
dtype: int64

In [330]:
#選取子集
mask = obj.isin(['b' , 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [331]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [334]:
# missing value 處理
string_data = Series (['aardvark' , 'artichoke' , np.nan, 'avOEado'] )
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [337]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [344]:
#處理缺失數據
string_data.fillna('x')

0            x
1    artichoke
2            x
3      avOEado
dtype: object

In [342]:
#過濾缺失數據
from numpy import nan as NA

In [343]:
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [345]:
data = DataFrame([[1., 6.5,3.] , [1.,NA,NA],
[NA, NA, NA] , [NA, 6.5,3.]])
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [346]:
cleaned = data.dropna()
cleaned

   0    1  2
0  1  6.5  3

In [350]:
#指丟棄全為NA的
cleaned = data.dropna(how='all')
cleaned

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
3 NaN  6.5   3 NaN

In [351]:
data [4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [354]:
#丟棄行
data.dropna(axis=1 , how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [357]:
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.983231  0.749591 -0.918535
1 -0.479522 -0.425800 -0.834488
2  0.445522 -0.239060 -1.067180
3 -1.167025 -0.549583 -1.433596
4  1.245491 -0.678161  1.201569
5 -0.668210  0.806142 -0.194644
6 -1.146666 -0.341677 -0.673095

In [360]:
df.ix[:4, 1] = NA
df.ix[:2, 2] = NA
df

          0         1         2
0  0.983231       NaN       NaN
1 -0.479522       NaN       NaN
2  0.445522       NaN       NaN
3 -1.167025       NaN -1.433596
4  1.245491       NaN  1.201569
5 -0.668210  0.806142 -0.194644
6 -1.146666 -0.341677 -0.673095

In [368]:
#留下部分觀測值
df.dropna(thresh=3)

          0         1         2
5 -0.668210  0.806142 -0.194644
6 -1.146666 -0.341677 -0.673095

In [371]:
#以 dict 填補多個缺失值
df.fillna({1:0.5,2:-1})

          0         1         2
0  0.983231  0.500000 -1.000000
1 -0.479522  0.500000 -1.000000
2  0.445522  0.500000 -1.000000
3 -1.167025  0.500000 -1.433596
4  1.245491  0.500000  1.201569
5 -0.668210  0.806142 -0.194644
6 -1.146666 -0.341677 -0.673095

In [374]:
#fillna默認返回新封象， 但也可以對現有對象遊行就地修改:
_ = df.fillna({1:0.5,2:-1}, inplace=True)

df

          0         1         2
0  0.983231  0.500000 -1.000000
1 -0.479522  0.500000 -1.000000
2  0.445522  0.500000 -1.000000
3 -1.167025  0.500000 -1.433596
4  1.245491  0.500000  1.201569
5 -0.668210  0.806142 -0.194644
6 -1.146666 -0.341677 -0.673095

In [375]:
#以前用過的 對 reindex 有效的插值方法 也可以用
df = DataFrame(np.random.randn(6, 3))
df.ix[2: , 1] = NA ; df.ix[4: , 2] = NA
df

          0         1         2
0 -2.068497  0.074329 -0.197801
1  0.831236  0.615549  0.210433
2 -0.756077       NaN -0.269599
3 -1.051482       NaN -0.406468
4  0.228548       NaN       NaN
5 -1.241753       NaN       NaN

In [377]:
df.fillna(method ='ffill' , limit=2 )

          0         1         2
0 -2.068497  0.074329 -0.197801
1  0.831236  0.615549  0.210433
2 -0.756077  0.615549 -0.269599
3 -1.051482  0.615549 -0.406468
4  0.228548       NaN -0.406468
5 -1.241753       NaN -0.406468

In [378]:
data = Series([1., NA, 3.5, NA, 7])

In [379]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [381]:
#層次化 index
data = Series(np.random.randn(10),
              index= [[ 'a','a','a','b','b','b','c','c','d','d'],
[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

data

a  1   -0.404739
   2    0.471057
   3    1.428800
b  1   -0.756621
   2    0.228748
   3    0.708629
c  1   -0.114163
   2    1.516897
d  2    1.366661
   3    0.498947
dtype: float64

In [382]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [383]:
data['b']

1   -0.756621
2    0.228748
3    0.708629
dtype: float64

In [384]:
data.ix[['b' , 'd']]

b  1   -0.756621
   2    0.228748
   3    0.708629
d  2    1.366661
   3    0.498947
dtype: float64

In [386]:
# 選取內層
data[: , 2]

a    0.471057
b    0.228748
c    1.516897
d    1.366661
dtype: float64

In [387]:
# 重新安排到 DataFrame
data.unstack()

          1         2         3
a -0.404739  0.471057  1.428800
b -0.756621  0.228748  0.708629
c -0.114163  1.516897       NaN
d       NaN  1.366661  0.498947

In [388]:
data.unstack().stack()

a  1   -0.404739
   2    0.471057
   3    1.428800
b  1   -0.756621
   2    0.228748
   3    0.708629
c  1   -0.114163
   2    1.516897
d  2    1.366661
   3    0.498947
dtype: float64

In [391]:
# DataFrame 的 index 分層

frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a','a','b','b'],[1,2,1,2]],
                 columns = [['Roxas','Roxas','Zoxas'],
                           ['green','red','green']])

frame

    Roxas     Zoxas
    green red green
a 1     0   1     2
  2     3   4     5
b 1     6   7     8
  2     9  10    11

In [401]:
frame.index.names = [ 'key1', 'key2' ]
frame.columns.names = [ 'state' , 'color' ]
frame

state     Roxas     Zoxas
color     green red green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [394]:
frame['Roxas']

color       green  red
 key1 key2
a     1         0    1
      2         3    4
b     1         6    7
      2         9   10

In [398]:
MultiIndex.from_arrays ([[ 'Ohio' , 'Ohio' , 'Colorado'], 
                          ['Green' , 'Red' , 'Green']],
                         names= ['state' , 'color'])

MultiIndex(levels=[[u'Colorado', u'Ohio'], [u'Green', u'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=[u'state', u'color'])

In [402]:
# 重新分級排序
frame.swaplevel('key1' , 'key2')

state     Roxas     Zoxas
color     green red green
key2 key1
1    a        0   1     2
2    a        3   4     5
1    b        6   7     8
2    b        9  10    11

In [405]:
frame

state     Roxas     Zoxas
color     green red green
key1 key2
a    1        0   1     2
     2        3   4     5
b    1        6   7     8
     2        9  10    11

In [407]:
frame.sortlevel(1)

state     Roxas     Zoxas
color     green red green
key1 key2
a    1        0   1     2
b    1        6   7     8
a    2        3   4     5
b    2        9  10    11

In [408]:
frame.swaplevel(0,1).sortlevel(0)

state     Roxas     Zoxas
color     green red green
key2 key1
1    a        0   1     2
     b        6   7     8
2    a        3   4     5
     b        9  10    11

In [409]:
# 根據級別匯總統計
frame.sum(level='key2')

state Roxas     Zoxas
color green red green
key2
1         6   8    10
2        12  14    16

In [410]:
frame.sum(level='color' , axis=1)

color      green  red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [420]:
frame = DataFrame({'a' : range(7) ,
                  'b' : range(7,0,-1),
                  'c' : ['one','one','one','two','two','two','two'],
                  'd' : [0,1,2,0,1,2,3]})

frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [422]:
# 層次化 index 行 --> 列
frame2 = frame.set_index(['c' , 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [423]:
frame.set_index(['c' , 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [425]:
# 層次化 index 列 --> 行
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [426]:
ser3 = Series(range(3) , index=[-5, 1, 3])

In [436]:
ser3.iget_value(2) # 不考慮index 類型 基於位置的索引  直接 get value

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  if __name__ == '__main__':

2

In [443]:
frame = DataFrame(np.arange(6).reshape(3,2),index=[2,0,1],columns=['a','b'])
frame

   a  b
2  0  1
0  2  3
1  4  5

In [444]:
frame.irow(2)

C:\Anaconda2\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: irow(i) is deprecated. Please use .iloc[i]
  if __name__ == '__main__':

a    4
b    5
Name: 1, dtype: int32

In [450]:
#面板數據 相當於三維 DataFrame
import pandas.io.data as web
pdata = pd.Panel(dict((stk ,web.get_data_yahoo(stk,'1/1/2009','6/1/2012'))
                        for stk in ['AAPL','GOOG','MSFT','DELL'] ))

pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [457]:
pdata = pdata.swapaxes('items' , 'minor')
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 868 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [460]:
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.933430  10.39902  160.499779  16.716321
2009-01-05  12.437067  10.26359  163.861421  16.872549
2009-01-06  12.231930  10.68922  166.863420  17.069888
2009-01-07  11.967619  10.78596  160.844427  16.042077
2009-01-08  12.189851  10.90204  162.432840  16.543649
2009-01-09  11.911075  10.75694  157.377899  16.050300
2009-01-12  11.658599  10.30228  156.189080  16.009186
2009-01-13  11.533676  10.40869  157.003261  16.296974
2009-01-14  11.220711   9.97338  150.334921  15.696732
2009-01-15  10.964291  10.19587  149.345914  15.820069
2009-01-16  10.826218   9.93469  149.685575  16.206526
2009-01-20  10.283132   9.52840  141.234014  15.195160
2009-01-21  10.891967   9.86697  151.388865  15.935184
2009-01-22  11.619150   9.65416  153.097158  14.068680
2009-01-23  11.619150   9.80893  162.188089  14.142682
2009-01-26  11.787468   9.97338  161.773501  14.496248
2009-01-27  11.930800   9.74122  165.574702  14.520916
2009-01-28  12.387098  10.52477  174.161139  14.833372
2009-01-29  12.229300   9.62514  171.488809  14.463359
2009-01-30  11.851901   9.18983  169.096191  14.060457
2009-02-02  12.033368   9.00603  170.115172  14.660698
2009-02-03  12.226670   9.45101  170.055239  15.211605
2009-02-04  12.301624   9.47036  171.328962  15.318497
2009-02-05  12.684283   9.12212  176.683613  15.655620
2009-02-06  13.112966   9.15114  185.454867  16.165414
2009-02-09  13.479845   9.32526  189.196135  15.984520
2009-02-10  12.864435   8.86093  179.076231  15.458279
2009-02-11  12.731622   8.72550  178.841472  15.795401
2009-02-12  13.053792   8.87060  181.343964  15.836515
2009-02-13  13.039327   8.82224  178.661643  15.696732
...               ...       ...         ...        ...
2012-04-23  75.177318  15.57434  298.502008  28.512527
2012-04-24  73.675617  15.65173  300.335186  28.334991
2012-04-25  80.213692  15.88390  304.555978  28.583544
2012-04-26  79.911244  15.99030  307.428105  28.503652
2012-04-27  79.293207  15.90324  307.183354  28.388252
2012-04-30  76.792114  15.83553  302.123410  28.423760
2012-05-01  76.548846  15.86455  301.913607  28.414881
2012-05-02  77.055108  15.64689  303.327209  28.228468
2012-05-03  76.508079  15.70010  305.205309  28.192961
2012-05-04  74.329161  15.29381  298.187334  27.500564
2012-05-07  74.885397  15.30348  303.472045  27.207627
2012-05-08  74.714449  15.19708  306.089446  27.074474
2012-05-09  74.845950  15.15838  304.271262  27.305273
2012-05-10  75.022151  15.04230  306.524016  27.287519
2012-05-11  74.521148  14.91654  302.313200  27.660348
2012-05-14  73.404729  14.93589  301.698816  27.234258
2012-05-15  72.740665  14.83916  305.250263  26.993008
2012-05-16  71.808347  14.52477  314.151389  26.716019
2012-05-17  69.709642  14.45222  311.214326  26.555187
2012-05-18  69.743829  14.25875  299.900615  26.153107
2012-05-21  73.807111  14.48124  306.748784  26.581993
2012-05-22  73.240361  14.58765  300.100412  26.590928
2012-05-23  75.027411  12.08221  304.426106  26.010146
2012-05-24  74.338367  12.04351  301.528978  25.974404
2012-05-25  73.939925  12.05319  295.470050  25.965469
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.252272  12.24666  296.873645  26.412225
2012-05-30  76.159610  12.14992  293.821674  26.215653
2012-05-31  75.970256  11.92743  290.140354  26.081627
2012-06-01  73.768977  11.67592  285.205295  25.420428

[868 rows x 4 columns]

In [461]:
pdata.ix[: , '6/1 /2012' ,: ]

            Open        High         Low       Close     Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900   73.768977
DELL   12.150000   12.300000   12.045000   12.070000   19397600   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300   25.420428

In [462]:
pdata.ix[ 'Adj Close' , '5/22/2012': , :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  73.240361  14.58765  300.100412  26.590928
2012-05-23  75.027411  12.08221  304.426106  26.010146
2012-05-24  74.338367  12.04351  301.528978  25.974404
2012-05-25  73.939925  12.05319  295.470050  25.965469
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  75.252272  12.24666  296.873645  26.412225
2012-05-30  76.159610  12.14992  293.821674  26.215653
2012-05-31  75.970256  11.92743  290.140354  26.081627
2012-06-01  73.768977  11.67592  285.205295  25.420428

In [463]:
#呈現 panel的方式2
stacked = pdata.ix[: , '5/30/2012': , :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300

                   Adj Close
Date       minor
2012-05-30 AAPL    76.159610
           DELL    12.149920
           GOOG   293.821674
           MSFT    26.215653
2012-05-31 AAPL    75.970256
           DELL    11.927430
           GOOG   290.140354
           MSFT    26.081627
2012-06-01 AAPL    73.768977
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.420428

In [464]:
# to_frame()的逆運算
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT